// [ Сцена: финал на крыше ]
scenes.final = {
    //Объекты сцены -------------------------------------------------------------------------------
    objects: {
        //-----------------------------------------------------------------------------------------
        //Фон сцены -------------------------------------------------------------------------------
        //-----------------------------------------------------------------------------------------
        background: {
            //Ресурсы объекта ---------------------------------------------------------------------
            resources: {
                autos:    { type: 'image', src: '/res/final/autos.png' },
                street:  { type: 'image', src: '/res/final/street.png' },
                objects: { type: 'image', src: '/res/final/objects.png' }
            },
            
            //Инициализация объекта ---------------------------------------------------------------
            init: function() {
                //Создаем временные переменные
                this.tmp = {
                    x: 0, y:0,
                    width: game.scene.objects.background.resources.street.data.width,
                    img_auto: game.scene.objects.background.resources.autos.data,
                    img_street: game.scene.objects.background.resources.street.data,
                    img_objects: game.scene.objects.background.resources.objects.data,
                    
                    autos: {
                        show: false,
                        step: 0.0,
                        position: 0,
                        delay: 1,
                        // [ x, y, тип авто, смещение от соседа, полоса ]
                        arr:  [ [0,0,0,140,0], [0,0,1,280,0], [0,0,2,80,1], [0,0,3,250,0] ]
                    }
                };
            },
            
            //Обновление объекта ------------------------------------------------------------------
            update: function() {
                //Получаем короткие ссылки
                let ltmp = this.tmp;
                let autos = ltmp.autos;
                let offset_x = ltmp.x;
                let offset_y = ltmp.y;
                let autos_x = 0;
                let autos_y = 0;
                
                //Движение машин
                if( offset_x + game.canvas.width < ltmp.width - 350 ) {
                    autos.show = false;
                } else {
                    autos.show = true;
                    autos_x = ltmp.width - offset_x - 375;
                    autos_y = -40;
                    
                    //Анимация( 15 сек - 500px )
                    if( autos.delay !== game.delay ) {
                        autos.delay = game.delay;
                        autos.step =  ( 500 * autos.delay ) / 15000;
                    }
                    autos.position += autos.step;
                    if( autos.position >= 500.0) autos.position = 0.0;
                    
                    for( let i = 0, x = 0, y = 0; i < 4; i++) {
                        //Положение + смещение по "х"
                        x = Math.floor( autos.position + autos.arr[ i ][ 3 ] ) % 500;
                        y = Math.floor( x * 0.75 );
                        
                        //Движение закончилось
                        if( x === 499 ) {
                            //Ставим случайную тачку
                            autos.arr[ i ][ 2 ] = Math.round(Math.random()) + ( autos.arr[ i ][ 2 ] > 1 ? 2 : 0 );
                            //Ставим случайную полосу
                            autos.arr[ i ][ 4 ] = Math.floor(Math.random() * 2); 
                        }
                        
                        //Обновляем координаты
                        if( autos.arr[ i ][ 2 ] > 1 ) {
                            autos.arr[ i ][ 0 ] = autos_x + x - ( autos.arr[ i ][ 4 ] === 0 ? 0 : 30 );
                            autos.arr[ i ][ 1 ] = autos_y + y;
                        } else {
                            autos.arr[ i ][ 0 ] = autos_x + 535 - x;
                            autos.arr[ i ][ 1 ] = autos_y + 375 - y;
                        }
                    }
                }
            },
            
            //Отрисовка объекта -------------------------------------------------------------------
            draw: function() {
                //Получаем короткие ссылки
                let ltmp = this.tmp;
                let context = game.canvas.context;
                let offset_x = ltmp.x;
                let offset_y = ltmp.y;
                
                //Заливаем фон черным
                context.fillStyle = '#000000';
                context.fillRect( 0, 0, game.canvas.width, game.canvas.height );
                
                //Рисуем улицу
                context.drawImage( ltmp.img_street, offset_x,offset_y, 640,360,   0,0, 640,360 );
                
                //Рисуем автомобили
                if( ltmp.autos.show ) {
                    for( let i = 0, dx = 0, dy = 0; i < 4; i++ ) {
                        context.drawImage( ltmp.img_auto, 
                            ltmp.autos.arr[ i ][ 2 ] * 50, 0, 50, 44, 
                            ltmp.autos.arr[ i ][ 0 ], ltmp.autos.arr[ i ][ 1 ],  50, 44
                        );
                    }
                }
                
                //Рисуем объекты на улице
                context.drawImage( ltmp.img_objects, offset_x,offset_y, 640,360,   0,0, 640,360 );
            }
        },
    
        //-----------------------------------------------------------------------------------------
        //Фон сцены -------------------------------------------------------------------------------
        //-----------------------------------------------------------------------------------------
        anon: {
            //Ресурсы объекта ---------------------------------------------------------------------
            resources: {},
            
            //Анимации объекта --------------------------------------------------------------------
            animations: {
                menu: [
                    [
                        //Параметры анимации [ ms_anim, next_index ]
                        [ 3000, 1 ],
                        //Ботинок (левый)
                        [ 49,137, 0,0,0,255,    44,133,  41,141,  59,141,  59,137,  54,133,  50,133 ],
                        //Голень (левая)
                        [ 46,127, 0,0,0,255,  41,113,  44,133,  50,133,  50,113 ],
                        //Бедро (левое)
                        [ 46,100, 0,0,0,255,    33,82,   30,97,   30,111,  32,116,  54,117,  58,112,  59,87 ],
                        //Ботинок (правый)
                        [ 72,135, 0,0,0,255,    62,127,  59,128,  69,137,  76,140,  79,136,  76,131,  71,129 ],
                        //Голень (правая)
                        [ 70,115, 0,0,0,255,  64,106,  62,120,  63,130,  69,132,  76,111, 77,105 ],
                        //Бедро (правое)
                        [ 63,96, 0,0,0,255,    64,106,   57,101,   45,98,  35,95,  46,88,  55,81,  59,85,  68,89, 74,91,  77,94, 77,101, 77,107 ],
                        //Торс
                        [ 45,65,  0,0,0,255,   37,36,   30,71,   31,92,   36,96,   45,93,   53,87,   58,80,   59,61,  59,35 ],
                        //Голова
                        [ 53,25,  0,0,0,255,  68,8,   67,9,   51,6,   37,14,   36,29,   33,38,   52,45, 63,37, 66,25, 68,10, 69,9 ],
                        //Шапка/прическа т. д.
                        [ 67,9,  0,0,0,255,     67,9,   59,14,   47,15,    37,14,    47,15,    59,14,   54,31,   52,45, 54,31, 59,14 ]
                    ],
                    [
                        //Параметры анимации [ ms_anim, next_index ]
                        [ 3000, 0 ],
                        //Ботинок (левый)
                        [ 49,137, 0,0,0,255,    44,133,  41,141,  59,141,  59,137,  54,133,  50,133 ],
                        //Голень (левая)
                        [ 46,127, 0,0,0,255,  41,113,  44,133,  50,133,  50,113 ],
                        //Бедро (левое)
                        [ 46,100, 0,0,0,255,    33,82,   30,97,   30,111,  32,116,  54,117,  58,112,  59,87 ],
                        //Ботинок (правый)
                        [ 72,135, 0,0,0,255,    62,127,  59,128,  69,137,  76,140,  79,136,  76,131,  71,129 ],
                        //Голень (правая)
                        [ 70,115, 0,0,0,255,  64,106,  62,120,  63,130,  69,132,  76,111, 77,105 ],
                        //Бедро (правое)
                        [ 63,96, 0,0,0,255,    64,106,   57,101,   45,98,  35,95,  46,88,  55,81,  59,85,  68,89, 74,91,  77,94, 77,101, 77,107 ],
                        //Торс
                        [ 45,65,  0,0,0,255,   37,36,   38,71,   31,92,   36,96,   45,93,   53,87,   58,80,   59,61,  59,35 ],
                        //Голова
                        [ 53,25,  0,0,0,255,  68,8,   67,9,   51,6,   37,14,   36,29,   33,38,   52,45, 63,37, 66,25, 68,10, 69,9 ],
                        //Шапка/прическа т. д.
                        [ 67,9,  0,0,0,255,     67,9,   59,14,   47,15,    37,14,    47,15,    59,14,   54,31,   52,45, 54,31, 59,14 ]
                    ]
                ]
            },
            
            //Инициализация объекта ---------------------------------------------------------------
            init: function() {
                //Создаем временные переменные
                this.tmp = {
                    x: 300,
                    y: 200,
                    rotation: 0,
                    line_color: [ 255, 255, 255, 255 ],
                    body: [
                        //Ботинок (левый)
                        [ 49,137, 0,0,0,255,    44,133,  41,141,  59,141,  59,137,  54,133,  50,133 ],
                        //Голень (левая)
                        [ 46,127, 0,0,0,255,  41,113,  44,133,  50,133,  50,113 ],
                        //Бедро (левое)
                        [ 46,100, 0,0,0,255,    33,82,   30,97,   30,111,  32,116,  54,117,  58,112,  59,87 ],
                        //Ботинок (правый)
                        [ 72,135, 0,0,0,255,    62,127,  59,128,  69,137,  76,140,  79,136,  76,131,  71,129 ],
                        //Голень (правая)
                        [ 70,115, 0,0,0,255,  64,106,  62,120,  63,130,  69,132,  76,111, 77,105 ],
                        //Бедро (правое)
                        [ 63,96, 0,0,0,255,    64,106,   57,101,   45,98,  35,95,  46,88,  55,81,  59,85,  68,89, 74,91,  77,94, 77,101, 77,107 ],
                        //Торс
                        [ 45,65,  0,0,0,255,   37,36,   30,71,   31,92,   36,96,   45,93,   53,87,   58,80,   59,61,  59,35 ],
                        //Голова
                        [ 53,25,  0,0,0,255,  68,8,   67,9,   51,6,   37,14,   36,29,   33,38,   52,45, 63,37, 66,25, 68,10, 69,9 ],
                        //Шапка/прическа т. д.
                        [ 67,9,  0,0,0,255,     67,9,   59,14,   47,15,    37,14,    47,15,    59,14,   54,31,   52,45, 54,31, 59,14 ]
                    ]
                };
            },
            
            //Обновление объекта ------------------------------------------------------------------
            update: function() {
                //Получаем короткие ссылки
                let ltmp = this.tmp;

            },
            
            //Отрисовка объекта -------------------------------------------------------------------
            draw: function() {
                //Получаем короткие ссылки
                let ltmp = this.tmp;
                let context = game.canvas.context;
                let body = ltmp.body;
                
                DrawBody( body, ltmp.line_color, ltmp.x, ltmp.y );
            }
        }
    }
};
